DataProcessors/СозданиеЗадачПоНеотправленнымПлатежкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СозданиеЗадачПоНеотправленнымПлатежкам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДнейПроизводственногоКалендаря</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>(Общ) Рабочий день</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/СозданиеЗадачПоНеотправленнымПлатежкам/Ext/ObjectModule.bsl
Процедура СоздатьЗадачи(пОрганизация = Неопределено, пДатаНачала = Неопределено, пДатаОкончания = Неопределено) Экспорт
	ВыполнитьЗадачиСОтправленнымиПлатежками();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(?(пДатаНачала <> Неопределено, пДатаНачала, ПолучитьПредыдущийРабочийДень(ТекущаяДата()))));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(?(пДатаОкончания <> Неопределено, пДатаОкончания, ПолучитьПредыдущийРабочийДень(ТекущаяДата()))));
	Запрос.УстановитьПараметр("Организация", пОрганизация);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РасходИзБанка.Ссылка
	               |ИЗ
	               |	Документ.РасходИзБанка КАК РасходИзБанка
	               |ГДЕ
	               |	РасходИзБанка.Проведен
	               |	И НЕ РасходИзБанка.Оплачено
	               |	И РасходИзБанка.Дата >= &НачалоПериода
	               |	И РасходИзБанка.Дата <= &КонецПериода
	               |	И (РасходИзБанка.Организация = &Организация
	               |			ИЛИ &Организация = НЕОПРЕДЕЛЕНО)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоздатьЗадачуПоДокументу(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

Процедура СоздатьЗадачуПоДокументу(пДокумент)
	обЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	обЗадача.ВидЗадачи = Справочники.ВидыЗадачПользователей.НеотправленныеПлатежи;
	обЗадача.Дата = ТекущаяДата();
	обЗадача.ОбъектЗадачи = пДокумент;
	обЗадача.Ответственный = Константы.ОтветственныйЗаБанковскиеОперации.Получить();	
	обЗадача.Исполнитель = Константы.ОтветственныйЗаБанковскиеОперации.Получить();	
	обЗадача.Организация = пДокумент.Организация;
	обЗадача.Оповещение = Истина;
	обЗадача.СрокИсполнения = НачалоДня(ТекущаяДата());
	обЗадача.СрокОповещения = НачалоДня(ТекущаяДата());
	обЗадача.Наименование = "Документ " + пДокумент + " не отправлен в банк";
	обЗадача.Записать();
КонецПроцедуры

Процедура ВыполнитьЗадачиСОтправленнымиПлатежками()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗадачаИсполнителя.Ссылка
	               |ИЗ
	               |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	               |ГДЕ
	               |	ЗадачаИсполнителя.ВидЗадачи = ЗНАЧЕНИЕ(Справочник.ВидыЗадачПользователей.НеотправленныеПлатежи)
	               |	И НЕ ЗадачаИсполнителя.Выполнена";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		обЗадача = Выборка.Ссылка.ПолучитьОбъект();
		обЗадача.ВыполнитьЗадачу();
		обЗадача.Записать();
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьПредыдущийРабочийДень(пДата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", пДата);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
	               |ИЗ
	               |	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	               |ГДЕ
	               |	(РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	               |			ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	               |	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря < &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаКалендаря УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаКалендаря;
	Иначе
		Возврат пДата - 86400;
	КонецЕсли;
КонецФункции
